[
  {
    "Age": 13,
    "Case": "19-0400694",
    "DOB": "12/05/2005",
    "Date": "02/09/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "7",
    "First Name": "Messiah",
    "Gender": "male",
    "Last Name": "Mouton",
    "Link": "http://austintexas.gov/news/traffic-fatality-7-4",
    "Location": "6000 block of Springdale Road",
    "Notes": "The preliminary investigation shows that the driver of a 1997, red BMW was traveling northbound in the 6000 block of Springdale Road and lost control. The vehicle skidded sideways before flipping and striking a utility pole.\n\n\tThe passenger in the vehicle, Messiah Zion Mouton, was pronounced deceased at the scene.",
    "Time": "12:48 PM"
  },
  {
    "Age": 32,
    "Case": "19-0370320",
    "DOB": "02/18/1986",
    "Date": "02/06/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "6",
    "First Name": "Trevor",
    "Gender": "male",
    "Last Name": "Ralston",
    "Link": "http://austintexas.gov/news/traffic-fatality-6-6",
    "Location": "1000 block of W. Oltorf Street",
    "Notes": "The preliminary investigation shows that the driver of a gray, 2008 Mini Cooper was travelling westbound in the 1000 block of W. Oltorf Street when she lost control and slid into the eastbound path of a gray, 2018 Honda motorcycle. The motorcycle, driven by Trevor Ralston, struck the right side of the Mini Cooper.\n\n\tTrevor Ralston was pronounced deceased on scene. The driver of the Mini Cooper remained at the crash location and was cited for failure to control speed.",
    "Time": "07:02 AM"
  },
  {
    "Age": 21,
    "Case": "19-0320079",
    "DOB": "10/23/1997",
    "Date": "02/01/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "5",
    "First Name": "Mark",
    "Gender": "male",
    "Last Name": "Sands",
    "Link": "http://austintexas.gov/news/traffic-fatality-5-7",
    "Location": "500 block N. IH 35 service road southbound",
    "Notes": "The preliminary investigation shows that a 2006 silver Volkswagen Jetta operated by an Uber driver was traveling southbound in the right lane of N. IH-35 southbound on the service road. The Jetta changed lanes to enter the ramp of southbound IH 35 when it encountered a Lime scooter. The pedestrian on the scooter was traveling the wrong way, northbound in the southbound left lane of the IH-35 service road. The pedestrian was transported to Dell Seton Medical Center at the University of Texas. He was pronounced deceased at 2:30 p.m. on Saturday, Feb. 2, 2019. The Uber driver remained on scene and is cooperating as this investigation continues.\n\n\tThe toxicology results in this case are still pending.",
    "Time": "12:52 AM"
  },
  {
    "Age": 58,
    "Case": "19-0260086",
    "DOB": "12/31/1960",
    "Date": "01/26/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "4",
    "First Name": "Laura",
    "Gender": "female",
    "Last Name": "Wray",
    "Link": "http://austintexas.gov/news/traffic-fatality-4-6",
    "Location": "6900 block N. IH-35 SB",
    "Notes": "The preliminary investigation shows that a black, Ford F-150 was traveling southbound on IH-35. A pedestrian, identified as 58-year-old Laura Wray, was traveling eastbound near the 6900 block of N IH-35, when the vehicle struck her. The victim was pronounced deceased at the scene at 01:48 a.m.",
    "Time": "01:02 AM",
    "Vehicle": "2014 Ford F-150 (black)"
  },
  {
    "Age": 15,
    "Case": "19-0081623",
    "DOB": "02/18/2003",
    "Date": "01/08/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "3",
    "First Name": "Jesus",
    "Gender": "male",
    "Last Name": "Servantez",
    "Link": "http://austintexas.gov/news/traffic-fatality-3-4",
    "Location": "3600 block of South Capital of Texas Highway SB",
    "Notes": "The preliminary investigation shows that the driver of a silver, 2018 KIA was traveling in the center lane of the 3600 block of South Capital of Texas Highway SB when the car collided with Jesus Servantez, a pedestrian in the roadway. The driver remained at the scene and told investigators that he did not see Servantez prior to the crash.\n\n\tJesus Servantez was transported to Saint David’s South Austin Medical Center where he succumbed to his injuries on January 21, 2019. No charges are expected to be filed.",
    "Time": "09:37 PM"
  },
  {
    "Age": 31,
    "Case": "19-0150158",
    "DOB": "07/09/1987",
    "Date": "01/15/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "1",
    "First Name": "David",
    "Gender": "male",
    "Last Name": "Sell",
    "Link": "http://austintexas.gov/news/traffic-fatality-1-4",
    "Location": "10500 block of N IH 35 SB",
    "Notes": "The preliminary investigation shows that a 2000 Peterbilt semi truck was travelling southbound in the center lane on IH 35 when it struck pedestrian David Sell. The driver stopped as soon as it was possible to do so and remained on scene. He reported not seeing the pedestrian prior to impact given that it was still dark at the time of the crash. Sell was pronounced deceased at the scene at 6:24 a.m. No charges are expected to be filed.",
    "Time": "06:20 AM"
  },
  {
    "Age": 58,
    "Case": "19-0161105",
    "DOB": "02/15/1960",
    "Date": "01/16/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "2",
    "First Name": "Ann",
    "Gender": "female",
    "Last Name": "Bottenfield-Seago",
    "Link": "http://austintexas.gov/news/traffic-fatality-2-3",
    "Location": "West William Cannon Drive and Ridge Oak Road",
    "Notes": "The preliminary investigation shows that the grey, 2003 Volkwagen Jetta being driven by Ann Bottenfield-Seago failed to yield at a stop sign while attempting to turn westbound on to West William Cannon Drive from Ridge Oak Road. The Jetta collided with a black, 2017 Chevrolet truck that was eastbound in the inside lane of West William Cannon Drive. Bottenfield-Seago was pronounced deceased at the scene. The passenger in the Jetta and the driver of the truck were both transported to a local hospital with non-life threatening injuries. No charges are expected to be filed.",
    "Time": "03:42 PM"
  },
  {
    "Age": 19,
    "Case": "19-0581824",
    "DOB": "01/20/2000",
    "Date": "02/27/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "10",
    "First Name": "Javier",
    "Gender": "male",
    "Last Name": "Esparza",
    "Link": "http://austintexas.gov/news/traffic-fatality-10-4",
    "Location": "East 7th Street and Springdale Road",
    "Notes": "The preliminary investigation shows a white, 2000 Lexus RX300 was traveling eastbound on East 7th Street when the driver ran a red light and struck a grey, 2004 Volkswagen Golf moving northbound on Springdale Road. The force of the impact caused both the Lexus and Volkswagen to also strike a white, 2019 Jeep Cherokee that was stopped at the red light.\n\n\tThe driver of the Volkswagen Golf, Javier Emanuel Niño Esparza, was pronounced deceased at the scene.\n\n\tThe driver of the Lexus, Duane Harris, 29, was transported to a local hospital for treatment following the crash as were two other occupants from the vehicle. Harris has been charged with intoxication manslaughter.\n Duane Harris",
    "Time": "10:25 PM"
  },
  {
    "Age": 64,
    "Case": "19-0521894",
    "DOB": "10/10/1954",
    "Date": "02/21/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "9",
    "First Name": "Rosbel",
    "Gender": "male",
    "Last Name": "Tamez",
    "Link": "http://austintexas.gov/news/traffic-fatality-9-4",
    "Location": "7300 block of E. Riverside Dr.",
    "Notes": "The preliminary investigation shows a silver 2017 Jeep Patriot was traveling eastbound in the 7300 block of E. Riverside Dr. A pedestrian, Rosbel Tamez, was crossing Riverside near Uphill St. when he was struck by the Jeep. Mr. Tamez was transported to St. David’s South Austin Hospital where he died a short time later.",
    "Time": "11:56 PM"
  },
  {
    "Age": 37,
    "Case": "19-0521569",
    "DOB": "04/15/1981",
    "Date": "02/21/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "8",
    "First Name": "Blair",
    "Gender": "female",
    "Last Name": "Dismukes",
    "Link": "http://austintexas.gov/news/traffic-fatality-8-4",
    "Location": "8100 block of N. Lamar Blvd.",
    "Notes": "The preliminary investigation shows that two pedestrians were crossing mid-block in the 8100 block of N. Lamar Blvd. when both were struck by an unknown vehicle. One pedestrian had minor injuries and the other was pronounced deceased at the scene. The vehicle that hit them fled and has not been yet identified.",
    "Time": "08:30 PM"
  },
  {
    "Age": 5,
    "Case": "19-0800389",
    "DOB": "12/12/2013",
    "Date": "03/21/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "14",
    "First Name": "Illianna",
    "Gender": "female",
    "Last Name": "Martinez",
    "Link": "http://austintexas.gov/news/traffic-fatality-14-5",
    "Location": "Palo Blanco Ln. and Teri Rd.",
    "Notes": "The preliminary investigation shows that a 2013, blue Dodge Ram was traveling eastbound on Teri Rd. approaching Palo Blanco Ln. A 2010, gold Toyota Venza was traveling northbound on Palo Blanco, turning left onto Teri Rd. The Ram hit the Venza on the left side. All occupants of the Ram fled on foot. All occupants of the Venza were transported to Dell Children’s Medical Center of Central Texas. The juvenile female, Illianna Martinez, died on March 30, 2019 at 4:26 p.m.",
    "Time": "07:40 AM"
  },
  {
    "Age": 53,
    "Case": "19-0761827",
    "DOB": "06/30/1965",
    "Date": "03/17/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "13",
    "First Name": "Earnest",
    "Gender": "male",
    "Last Name": "Turner",
    "Link": "http://austintexas.gov/news/traffic-fatality-13-4",
    "Location": "3100 block of N IH 35",
    "Notes": "The preliminary investigation shows that a 2005, silver Nissan Altima was traveling northbound in the 35 block of N IH 35. A pedestrian was attempting to cross IH 35, eastbound, and was struck by the Nissan.\n\n\tThe driver of the Nissan was transported to Dell Seton Medical Center at the University of Texas with minor injuries. The driver showed no signs of impairment and no charges are expected.\n\n\tThe pedestrian, Earnest Turner, was pronounced deceased on March 30, 2019 at 4:20 p.m.",
    "Time": "09:32 PM"
  },
  {
    "Age": 45,
    "Case": "19-0881844",
    "DOB": "11/21/1973",
    "Date": "03/29/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "12",
    "First Name": "Carlos",
    "Gender": "male",
    "Last Name": "Cardenas",
    "Link": "http://austintexas.gov/news/traffic-fatality-12-4",
    "Location": "7300 S. Congress Avenue",
    "Notes": "The preliminary investigation shows that a 2001, white Chrysler Sebring was traveling northbound in the 7300 block of S. Congress Avenue. Two pedestrians were crossing mid-block in the unlit portion of S. Congress Avenue. The car struck one of the pedestrians and he was pronounced deceased at the scene.\n\n\tThe driver of the Chrysler remained on scene. No charges are expected to be filed against the driver.",
    "Time": "08:18 PM"
  },
  {
    "Age": 28,
    "Case": "19-0871796",
    "DOB": "10/15/1990",
    "Date": "03/28/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "11",
    "First Name": "Jessica",
    "Gender": "female",
    "Last Name": "Saathoff",
    "Link": "http://austintexas.gov/news/traffic-fatality-11-4",
    "Location": "1100 E. Martin Luther King Jr. Blvd.",
    "Notes": "The preliminary investigation shows that a 2013, white Toyota 4 Runner was traveling westbound on E. MLK Jr. Blvd. in the left lane. Witnesses stated that a bicyclist was traveling eastbound on MLK and crossed over the double yellow lines into the path of the Toyota. The bicyclist, Jessica Rae Saathoff, was transported to Dell Seton Medical Center at the University of Texas where she died a short time later.\n\tThe driver of the Toyota remained on scene. No charges are expected to be filed against the driver.",
    "Time": "09:05 PM"
  },
  {
    "Age": 27,
    "Case": "19-0921776",
    "DOB": "06/24/1991",
    "Date": "04/02/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "15",
    "First Name": "Garrett",
    "Gender": "male",
    "Last Name": "Davis",
    "Link": "http://austintexas.gov/news/traffic-fatality-15-4",
    "Location": "517 E. Slaughter Lane",
    "Notes": "Keaton Michael Carnley | White male | 11/13/1991                  \n\n\tThe preliminary investigation indicated that Garrett Davis, the driver of the 2017 Subaru Forester, was traveling eastbound in the 500 block of E. Slaughter Lane when he attempted to turn left and collided with a 1996 Chevrolet truck that was traveling westbound. Mr. Davis was attempting to enter the apartment complex on the south side of the road when he failed to yield right of way. The truck made contact with the passenger side of the Forester, killing both the driver and passenger, Keaton Carnley. There were no other occupants in the Subaru. The driver of the truck suffered minor injuries. All parties were wearing their seatbelts. No charges are expected to be filed.",
    "Time": "10:01 PM"
  },
  {
    "Age": 69,
    "Case": "19-0961200",
    "DOB": "08/01/1949",
    "Date": "04/06/2019",
    "Ethnicity": "Asian",
    "Fatal crashes this year": "17",
    "First Name": "Wing",
    "Gender": "male",
    "Last Name": "Chou",
    "Link": "http://austintexas.gov/news/traffic-fatality-17-4",
    "Location": "14000 block of N. SH-45",
    "Notes": "The preliminary investigation revealed that the 2010, blue Honda driven by Wing Chou was travelling eastbound in the 14000 block of N. SH-45 when he lost control and slid into a concrete barrier before rear-ending a parked Austin Fire Department apparatus truck. The AFD vehicle’s emergency lights were activated as it was partially blocking a lane of traffic to help protect a wrecker driver who was loading up a vehicle that had been involved in a separate collision.\n\n\tAustin firefighters extracted Mr. Chou and his passenger. They were both transported to St. David’s Round Rock Medical Center where Chou later died from his injuries. The passenger in the vehicle had serious, but not life-threatening injuries. Both occupants were wearing seat belts at the time of the crash.",
    "Time": "03:26 PM"
  },
  {
    "Age": 25,
    "Case": "19-0930132",
    "DOB": "01/15/1994",
    "Date": "04/03/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "16",
    "First Name": "Hannah",
    "Gender": "female",
    "Last Name": "Jaggers",
    "Link": "http://austintexas.gov/news/traffic-fatality-16-4",
    "Location": "E. Wells Branch Parkway/S. Heatherwilde Boulevard",
    "Notes": "The preliminary investigation revealed that the 2017 Dodge Charger driven by Hannah Jaggers was traveling eastbound on E. Wells Branch Parkway near the intersection of S. Heatherwilde Boulevard when Ms. Jaggers veered left and struck the curb of the center media, going airborne. The vehicle rolled for several yards before stopping in the intersection. The driver was ejected. Hanna Jaggers was transported to St. David’s Round Rock Medical Center where she succumbed to her injuries on April 4, 2019.",
    "Time": "02:39 AM"
  },
  {
    "Age": 77,
    "Case": "19-1080673",
    "DOB": "08/23/1941",
    "Date": "04/18/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "21",
    "First Name": "Elvira",
    "Gender": "female",
    "Last Name": "Trujillo",
    "Link": "http://austintexas.gov/news/traffic-fatality-21-3",
    "Location": "FM 973 and Pearce Lane",
    "Notes": "The preliminary investigation revealed that a 2005, white Chevrolet pickup truck was traveling northbound on FM 973 at the intersection of Pearce Lane when the driver ran a red light and struck the 2001, white Hyundai Elantra that was attempting to turn left on to FM 973 from Pearce Lane. The Chevrolet truck hit the Hyundai on the driver’s side. The driver of the Hyundai was transported to South Austin Hospital where she died a short time later.",
    "Time": "10:15 AM"
  },
  {
    "Age": 46,
    "Case": "19-1110655",
    "DOB": "08/19/1972",
    "Date": "04/21/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "22",
    "First Name": "Aric",
    "Gender": "male",
    "Last Name": "Maxwell",
    "Link": "http://austintexas.gov/news/traffic-fatality-22-3",
    "Location": "5300 blk N. IH-35 SB",
    "Notes": "The preliminary investigation shows that the deceased, Aric Maxwell, attempted to cross N. IH-35 proper from westbound to eastbound when he was struck by a silver, 2016 Chevy Equinox traveling southbound in the inside lane. Aric Maxwell was transported to Dell Seton Medical Center at the University of Texas where he died from his injuries. The driver of the Equinox remained on scene and showed no signs of impairment. No charges are expected to be filed.",
    "Time": "10:38 AM"
  },
  {
    "Age": 19,
    "Case": "19-1080319",
    "DOB": "06/19/2019",
    "Date": "04/18/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "20",
    "Gender": "male",
    "Link": "http://austintexas.gov/news/traffic-fatality-20-4",
    "Location": "8000 block of West U.S. 290",
    "Notes": "The preliminary investigation revealed that a 2016, black Toyota 4Runner was exiting a private driveway at 8000 W. Hwy. 290. Signs are posted for right turn only and the driver of the 4Runner failed to comply and made a left turn. A 2008, gray Ford Mustang was traveling westbound in the inside lane and attempted to avoid the 4Runner but struck its front end. The Mustang continued into eastbound lanes of traffic and was struck by a 2013, maroon Dodge Ram.\n\n\tThe driver of the Mustang was pronounced deceased at the scene.",
    "Time": "06:53 AM"
  },
  {
    "Age": 70,
    "Case": "19-1070614",
    "DOB": "06/25/1948",
    "Date": "04/17/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "19",
    "First Name": "Michael",
    "Gender": "male",
    "Last Name": "Cannatti",
    "Link": "http://austintexas.gov/news/traffic-fatality-19-5",
    "Location": "Jollyville Rd. and Balcones Woods Drive.",
    "Notes": "The preliminary investigation revealed that a white, 2018 Isuzu conventional truck was traveling northbound in the 1100 block of Jollyville road, approaching the intersection of Balcones Woods Dr. A white, 2015 Cadillac XTS was traveling westbound on Balcones Woods Dr. The Isuzu failed to control speed and entered the intersection striking the Cadillac on the driver’s side. The Isuzu continued across the intersection and struck the front of a gray, 2013 Mazda sedan who was facing south on Jollyville Rd.\n\n\tThe driver of the Cadillac, Michael Cannatti, was transported to St. David’s Round Rock Medical Center where he died as a result of his injuries.",
    "Time": "10:22 AM"
  },
  {
    "Age": 55,
    "Case": "19-1070052",
    "DOB": "05/17/1963",
    "Date": "04/17/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "18",
    "First Name": "James",
    "Gender": "male",
    "Last Name": "Bourgeois",
    "Link": "http://austintexas.gov/news/traffic-fatality-18-4",
    "Location": "5600 block of S. Congress Avenue",
    "Notes": "The preliminary investigation revealed that a tan, 1998 Chevrolet pickup truck was traveling northbound in the 5600 block of S. Congress Avenue. The truck was in the far right lane, getting ready to move into the turn lane to head east on Stassney Ln. The pedestrian was crossing from westbound to eastbound, mid-block, about 150 feet from a controlled crosswalk. The driver of the truck did not see the pedestrian prior to impact. The pedestrian, James Bourgeois, was pronounced deceased at the scene. The driver remained on scene and there were no signs of impairment.",
    "Time": "12:53 AM"
  },
  {
    "Age": 48,
    "Case": "19-1220286",
    "DOB": "06/09/1970",
    "Date": "05/02/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "25",
    "First Name": "David",
    "Gender": "male",
    "Last Name": "Medrano",
    "Link": "http://austintexas.gov/news/traffic-fatality-25-update",
    "Location": "8700 block of N. Lamar Blvd.",
    "Notes": "Suspect vehicle description: \n\tThe preliminary investigation shows that a pedestrian was running from west to east on N. Lamar Blvd. in the 8700 block towards a Capital Metro bus stop. At the time, a Capital Metro bus was present. The pedestrian was struck by a dark colored, small SUV or truck as he was running across Lamar towards the bus stop. The vehicle continued to travel northbound on Lamar and fled the scene. The pedestrian was transported the Dell Seton Medical Center at the University of Texas where he died upon arrival.\n\tThe suspect vehicle possibly has damage to its right, front end.",
    "Time": "06:10 AM"
  },
  {
    "Age": 23,
    "Case": "19-1161832",
    "DOB": "11/24/1995",
    "Date": "04/26/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "24",
    "First Name": "Leon",
    "Gender": "male",
    "Last Name": "Salmeron",
    "Link": "http://austintexas.gov/news/traffic-fatality-24-5",
    "Location": "8200 block of the Research Boulevard SB Service Road",
    "Notes": "The preliminary investigation shows that the red, 2013 Ford F-150 driven by Leon Salmeron was traveling southbound in the 8200 block of the Research Boulevard Service Road when the driver of a grey, 2005 Honda Accord failed to yield right of way from a private drive while attempting to exit The Park at Crestview Apartments. The Ford F-150 and Honda collided causing the truck to strike a concrete support column.\n\n\tLeon Rogelio Andres Salmeron was pronounced deceased on scene. The driver of the Honda fled the scene on foot. That individual, once identified, will be charged with failure to stop and render aid.",
    "Time": "08:07 PM"
  },
  {
    "Age": 86,
    "Case": "19-1040737",
    "DOB": "06/04/1932",
    "Date": "04/14/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "23",
    "First Name": "John",
    "Gender": "male",
    "Last Name": "Guiling",
    "Link": "http://austintexas.gov/news/traffic-fatality-23-3",
    "Location": "11200 N. Mopac southbound",
    "Notes": "The preliminary investigation shows that a 2014, gray Mitsubishi sedan was traveling southbound in the inside lane of the 11200 block of N. Mopac southbound. The driver of the Mitsubishi stopped to yield right of way to an emergency vehicle when a 2012, white Chevrolet pickup failed to keep assured clear distance and struck the Mitsubishi from behind.\n\n\tThe driver of the Chevrolet was transported to St. David’s Round Rock Medical Center where he succumbed to his injuries on Tuesday, April 23, 2019 at 6:20 p.m.",
    "Time": "11:06 AM"
  },
  {
    "Age": 50,
    "Case": "19-1270134",
    "DOB": "12/27/1968",
    "Date": "05/07/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "26",
    "First Name": "Michael",
    "Gender": "male",
    "Last Name": "Mayes",
    "Link": "http://austintexas.gov/news/traffic-fatality-26-3",
    "Location": "100 block of N. IH-35 SB",
    "Notes": "The preliminary investigation shows Michael Mayes attempted to cross N. I-35 in the 100 block when he was struck by a southbound vehicle traveling in the inside lane. The driver stopped and rendered medical aid immediately. Michael Mayes was transported to a local hospital by Austin-Travis County EMS where he succumbed to his injuries. No charges are expected to be filed.",
    "Time": "02:52 AM"
  },
  {
    "Age": 26,
    "Case": "19-1320666",
    "DOB": "12/09/1992",
    "Date": "05/12/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "28",
    "First Name": "Cheyanne",
    "Gender": "female",
    "Last Name": "Serrano",
    "Link": "http://austintexas.gov/news/traffic-fatality-28-3",
    "Location": "1000 S. Mopac Expressway NB",
    "Notes": "The preliminary investigation shows that a 1999, tan Toyota Camry was traveling northbound on Mopac Expressway in the 1000 block. For unknown reasons, the driver lost control of the vehicle and slid into a tree in a grassy area between Mopac and the frontage road. Cheyanne Sage Serrano was pronounced deceased at the scene.",
    "Time": "09:58 AM"
  },
  {
    "Age": 21,
    "Case": "19-1320369",
    "DOB": "04/08/1998",
    "Date": "05/12/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "27",
    "First Name": "Christian",
    "Gender": "male",
    "Last Name": "Barrios",
    "Link": "http://austintexas.gov/news/traffic-fatality-27-4",
    "Location": "11100 N. IH 35 NB",
    "Notes": "The preliminary investigation shows that a 2018 Hyundai Elantra was traveling southbound in the northbound lanes of IH35. There were 911 calls placed that had APD patrol units in route to the area. Before officers arrived, the calls changed to a head-on crash. A 2008 white Hyundai Elantra hit the Yukon head on.\n\n\tThe driver of the Elantra, Chiristian Barrios, died at the scene.\n\n\tThe driver and passenger of the Yukon were transported to an area hospital with non-life threatening injuries. Both occupants of the Yukon were wearing seatbelts.",
    "Time": "03:50 AM"
  },
  {
    "Age": 52,
    "Case": "19-1321936",
    "DOB": "08/30/1966",
    "Date": "05/12/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "29",
    "First Name": "Patrick",
    "Gender": "male",
    "Last Name": "Ervin",
    "Link": "http://austintexas.gov/news/traffic-fatality-29-3",
    "Location": "12100 N. IH-35 NB Service road",
    "Notes": "30, 1966",
    "Time": "11:34 PM"
  },
  {
    "Age": 15,
    "Case": "19-1381928",
    "DOB": "04/27/2004",
    "Date": "05/18/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "31",
    "First Name": "Cesar",
    "Gender": "male",
    "Last Name": "Saunders",
    "Link": "http://austintexas.gov/news/traffic-fatality-31-3",
    "Location": "14000 block of N. IH-35 NB",
    "Notes": "The preliminary investigation shows that a red, 2014 Honda Civic was traveling northbound in the 14000 block of N. IH-35 NB at approximately 10:54 p.m. on May 18, 2019 when the vehicle struck Cesar Saunders. Saunders was attempting to cross I-35 on foot.\n\n\tThe driver of the vehicle was transported to an area hospital and was later admitted to ICU. Cesar Saunders was also transported to an area hospital where he died from his injuries at 1:14 a.m.",
    "Time": "10:54 PM"
  },
  {
    "Age": 64,
    "Case": "19-1380171",
    "DOB": "01/14/1955",
    "Date": "05/18/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "30",
    "First Name": "Victor",
    "Gender": "male",
    "Last Name": "Carr",
    "Link": "http://austintexas.gov/news/traffic-fatality-30-1",
    "Location": "1100 block of Airport Blvd.",
    "Notes": "The preliminary investigation shows that a 2011, gray Toyota Corolla was traveling northbound in the right lane in the 1100 block of Airport Blvd. A red, 2013 Kia Soul was traveling southbound on Airport Blvd. and turned left in front of the Corolla. The driver of the Kia was transported to Dell Seton Medical Center at the University of Texas and was pronounced deceased at 2:22 a.m. The driver and passenger of the Corolla were transported to an area hospital with non-life threatening injuries.",
    "Time": "01:58 AM"
  },
  {
    "Age": 40,
    "Case": "19-1390962",
    "DOB": "09/24/1978",
    "Date": "05/19/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "32",
    "First Name": "Halbert",
    "Gender": "male",
    "Last Name": "Hendricks",
    "Link": "http://austintexas.gov/news/traffic-fatality-32-5",
    "Location": "2700 block of S. Congress Avenue",
    "Notes": "The preliminary investigation shows that a gray, 2013 Dodge Ram was traveling eastbound on Cumberland Rd. approaching Congress Avenue. Cumberland ends at Congress with a T-intersection. The driver of the Ram, Halbert Hendricks, continued eastbound and impacted a cement barrier. Mr. Hendricks was transported to South Austin Hospital and died as a result of his injuries at 2:01 p.m. He was not wearing a seatbelt.",
    "Time": "01:15 PM"
  },
  {
    "Age": 25,
    "Case": "19-1521857",
    "DOB": "04/03/1994",
    "Date": "06/01/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "33",
    "First Name": "Luis",
    "Gender": "male",
    "Last Name": "Martinez-Vertiz",
    "Link": "http://austintexas.gov/news/traffic-fatality-33-5",
    "Location": "N. Lamar Boulevard and Morrow Street",
    "Notes": "The preliminary investigation shows that a silver, 2000 Nissan Xterra was traveling southbound on N. Lamar when the driver failed to yield the right of way and attempted to turn left on a flashing yellow light.  A white, 2018 Ford F450 truck that was moving northbound on Lamar proceeded through the intersection on green at which time the vehicles collided.\n\n\tThe passenger in the Nissan, Luis Fernando Martinez-Vertiz, was transported to a local hospital where he died from his injuries.\n\n\tThis is an ongoing investigation.",
    "Time": "10:20 PM"
  },
  {
    "Age": 35,
    "Case": "19-1530277",
    "DOB": "11/27/1983",
    "Date": "06/02/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "34",
    "First Name": "Lance",
    "Gender": "male",
    "Last Name": "Smith",
    "Link": "http://austintexas.gov/news/traffic-fatality-34-4",
    "Location": "Bundyhill Drive and E. Martin Luther King Jr. Boulevard",
    "Notes": "The preliminary investigation shows that Lance Christopher Smith was driving a blue, 2010 Nissan Altima southbound on Bundyhill when he ran the stop sign at E. Martin Luther King Jr. Boulevard and crashed through a guardrail.\n\n\tLance Smith was pronounced deceased on scene. An autopsy has been performed. The toxicology results are pending.\n\n\tThis is an ongoing investigation.",
    "Time": "02:48 AM"
  },
  {
    "Age": 49,
    "Case": "19-1540252",
    "DOB": "03/07/1970",
    "Date": "06/03/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "35",
    "First Name": "Cecil",
    "Gender": "male",
    "Last Name": "Walker",
    "Link": "http://austintexas.gov/news/traffic-fatality-35-3",
    "Location": "12000 block of S IH 35 southbound",
    "Notes": "The preliminary investigation shows that a 2002, silver Mercedes was traveling southbound on IH 35. For unknown reasons, a pedestrian was on the highway. The pedestrian was hit by the Mercedes and died at the scene.\n\n\tThe driver of the Mercedes remained on scene and cooperated. No charges are expected at this time.",
    "Time": "05:39 AM"
  },
  {
    "Age": 53,
    "Case": "19-1611200",
    "DOB": "11/25/1965",
    "Date": "06/10/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "37",
    "First Name": "Matthew",
    "Gender": "male",
    "Last Name": "Waters",
    "Link": "http://austintexas.gov/news/traffic-fatality-37-4",
    "Location": "400 E Oltorf Street",
    "Notes": "The preliminary investigation shows that the driver of a silver, 2016 Toyota Tundra was traveling westbound on E Oltorf Street when he took faulty evasive action, moving into the eastbound lane to avoid a vehicle that was stopped in front of him. The driver collided with the oncoming (eastbound) 2015 Harley Davidson motorcycle, driven by 53-year-old Matthew Waters.\n\tMr. Waters was transported to a local hospital where he was pronounced deceased.",
    "Time": "03:52 PM"
  },
  {
    "Age": 42,
    "Case": "19-1590874",
    "DOB": "11/08/1976",
    "Date": "06/08/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "36",
    "First Name": "Guadalupe",
    "Gender": "male",
    "Last Name": "Palacios",
    "Link": "http://austintexas.gov/news/traffic-fatality-36-3",
    "Location": "8900 block of N Capital of Texas Highway",
    "Notes": "The preliminary investigation shows that the driver of a white, 2016 Ford Explorer turned westbound on to N Capital of Texas Highway from Great Hills Trail. She failed to use the dedicated merge lane and moved into the right lane of the roadway, striking the box truck driven by Guadalupe Padilla Palacios. Palacios’ truck was overturned and hit a guard rail.\n\tGuadalupe Padilla Palacios was transported to a local hospital where he succumbed to his injuries on June 9, 2019.",
    "Time": "12:28 PM"
  },
  {
    "Age": 31,
    "Case": "19-1801699",
    "DOB": "04/01/1988",
    "Date": "06/29/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "38",
    "First Name": "Brendan",
    "Gender": "male",
    "Last Name": "O’Connor",
    "Link": "http://austintexas.gov/news/traffic-fatality-38-3",
    "Location": "Webberville Rd. and Springdale Rd.",
    "Notes": "The preliminary investigation shows that the driver of a 2015 BMW motorcycle was traveling southbound on Webberville Rd. approaching the Springdale Rd. intersection. The motorcycle struck the curb of a small median, which launched the driver from the motorcycle and into the utility pole. The motorcycle came to rest on Springdale Rd. and the driver died at the scene.",
    "Time": "08:43 PM"
  },
  {
    "Age": 28,
    "Case": "19-1880028",
    "DOB": "07/08/1991",
    "Date": "07/07/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "39",
    "First Name": "Leslie",
    "Gender": "female",
    "Last Name": "Valderrama",
    "Link": "http://austintexas.gov/news/traffic-fatality-39-4",
    "Location": "4600 E. Ben White Blvd.",
    "Notes": "The preliminary investigation shows that a 2012 Nissan Altima was traveling westbound in the 4600 block of E. Ben White Blvd. and rear-ended a 2007 Chevrolet Tahoe. The passenger of the Nissan was transported to St. David’s South Austin Hospital where she was pronounced deceased at 3:27 a.m.",
    "Time": "12:15 AM"
  },
  {
    "Age": 43,
    "Case": "19-1950368",
    "DOB": "11/18/1975",
    "Date": "07/14/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "40",
    "First Name": "Justin",
    "Gender": "male",
    "Last Name": "White",
    "Link": "http://austintexas.gov/news/traffic-fatality-40-4",
    "Location": "300 block of N. IH 35",
    "Notes": "The preliminary investigation shows that a pedestrian was crossing IH 35 from west to east in the 300 block when a 2007, blue Ford Explorer struck him. The pedestrian was pronounced deceased at the scene.\n\n\tThe driver of the Explorer remained on scene and was cooperative. No charges are expected at this time.",
    "Time": "04:20 AM"
  },
  {
    "Age": 38,
    "Case": "19-2031962",
    "DOB": "12/03/1980",
    "Date": "07/22/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "41",
    "First Name": "Christopher",
    "Gender": "male",
    "Last Name": "Forrest",
    "Link": "http://austintexas.gov/news/traffic-fatality-41-4",
    "Location": "11000 FM 2222 eastbound",
    "Notes": "The preliminary investigation shows that a black Honda CRB motorcycle was traveling eastbound on FM 2222 in the 11000 block when it left the roadway for an unknown reason. The driver of the motorcycle was pronounced deceased on scene.",
    "Time": "11:12 PM"
  },
  {
    "Age": 24,
    "Case": "19-2050100",
    "DOB": "10/09/1994",
    "Date": "07/24/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "42",
    "First Name": "Casey",
    "Gender": "male",
    "Last Name": "Ballard",
    "Link": "http://austintexas.gov/news/traffic-fatality-42-4",
    "Location": "1100 block S IH-35 NB",
    "Notes": "Casey Ballard was in the 1100 block of S IH-35 NB when a red, 2001 Nissan Frontier pickup that was traveling in the middle lane struck him. He was pronounced deceased on scene. The driver remained on site. There was no sign of driver impairment and no charges are expected to be filed.",
    "Time": "01:28 AM"
  },
  {
    "Age": 25,
    "Case": "19-2080141",
    "DOB": "09/07/1993",
    "Date": "07/27/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "43",
    "First Name": "Matthew",
    "Gender": "male",
    "Last Name": "McDonald",
    "Link": "http://austintexas.gov/news/traffic-fatality-43-5",
    "Location": "8200 N IH 35 southbound",
    "Notes": "The preliminary investigation shows that a pedestrian was in the roadway for an unknown reason. A 2016 Kenworth tractor/trailer was in the middle lane and struck the pedestrian. The pedestrian was pronounced deceased on scene. The driver remained on scene and was not impaired. No charges are expected to be filed.",
    "Time": "01:37 AM"
  },
  {
    "Age": 56,
    "Case": "19-2061923",
    "DOB": "11/02/1962",
    "Date": "07/25/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "45",
    "First Name": "Felix",
    "Gender": "male",
    "Last Name": "Ybarra",
    "Link": "http://austintexas.gov/news/traffic-fatality-45-5",
    "Location": "5700 S. Congress Avenue",
    "Notes": "The preliminary investigation shows Felix Ybarra was attempting to cross in the 5700 block of S. Congress Avenue, where there is no crosswalk, when he was struck by a maroon, 2013 Kia Sorrento. The driver remained on scene and showed no signs of intoxication.\n\n\tFelix Ybarra was transported to Saint David’s South Austin Medical Center where he died on July 30, 2019.",
    "Time": "10:33 PM"
  },
  {
    "Age": 28,
    "Case": "19-2090230",
    "DOB": "06/05/1991",
    "Date": "07/28/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "44",
    "First Name": "Xavier",
    "Gender": "male",
    "Last Name": "Tunsun",
    "Link": "http://austintexas.gov/news/traffic-fatality-44-5",
    "Location": "8700 Cameron Rd.",
    "Notes": "The preliminary investigation shows that a pedestrian, Xavier Tunsun, exited a 2016 Chrysler 300 while it was traveling northbound on Cameron Rd. An unknown vehicle struck Tunsun and left the scene northbound on Cameron Rd. The vehicle was possibly gold or tan with dark wheels or no hubcaps. This crash is being investigated as fail to stop and render aid, a 2nd degree felony.",
    "Time": "02:37 AM"
  },
  {
    "Age": 44,
    "Case": "19-2160076",
    "DOB": "11/20/1974",
    "Date": "08/04/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "46",
    "First Name": "Douglas",
    "Gender": "male",
    "Last Name": "Vogelsass",
    "Link": "http://austintexas.gov/news/traffic-fatality-46-6",
    "Location": "U.S. Hwy 290 and William Cannon Dr.",
    "Notes": "The preliminary investigation shows that Douglas Joseph Vogelsass was walking on William Cannon Dr. northbound across U.S. Highway 290. He disregarded the pedestrian control device and was struck by a 2013 Ford F150.\n\n\tDouglas Joseph Vogelsass was pronounced deceased at the scene.\n\n\tThe driver of the F150 remained on scene and was cooperative. No charges are expected to be filed.",
    "Time": "12:49 AM"
  },
  {
    "Age": 36,
    "Case": "19-2191570",
    "DOB": "07/13/1983",
    "Date": "08/07/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "47",
    "First Name": "Daryl",
    "Gender": "male",
    "Last Name": "Anderson",
    "Link": "http://austintexas.gov/news/traffic-fatality-47-6",
    "Location": "6600 block of E. Howard Ln.",
    "Notes": "The preliminary investigation shows that a 2018, white, Harley Davidson motorcycle was traveling eastbound in the 6600 block of E. Howard Ln. when it struck the inside curb. The motorcycle left the roadway and flipped several times in the center grassy median. The driver of the motorcycle was transported to St. David’s Round Rock Hospital where he was pronounced deceased at 8:32 p.m.\n\n\tExcessive speed is not considered to be a factor. The driver was not wearing a helmet.",
    "Time": "07:25 PM"
  },
  {
    "Age": 54,
    "Case": "19-2241378",
    "DOB": "09/27/1964",
    "Date": "08/12/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "48",
    "First Name": "Derril",
    "Gender": "male",
    "Last Name": "Lovelace",
    "Link": "http://austintexas.gov/news/traffic-fatality-48-6",
    "Location": "1800 W. Parmer Lane",
    "Notes": "The preliminary investigation shows that the driver of a black, 2014 Jeep Patriot was traveling eastbound in the inside lane of the 1800 block of W. Parmer Lane when he attempted to take evasive action to stop from striking a Hyundai Veloster that was stopped at the red light at Metric Boulevard. The Jeep clipped the back of the Veloster before jumping the curb of the inside median that divides east and westbound Parmer Lane, striking Derril Glen Lovelace who was standing on the narrow concrete strip. The driver of the Jeep also collided with a silver, 2008 Mitsubishi Lancer and a grey, 2015 Subaru Forester that were traveling westbound on W. Parmer Lane.\n\n\tDerril Glen Lovelace was transported to St. David’s Round Rock Medical Center where he was pronounced deceased. The driver of the Subaru Forester was transported to the St. David’s North Austin Medical Center with non-life threatening injuries.",
    "Time": "05:09 PM"
  },
  {
    "Age": 27,
    "Case": "19-2280292",
    "DOB": "01/13/1992",
    "Date": "08/16/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "49",
    "First Name": "Josephine",
    "Gender": "female",
    "Last Name": "Guerra",
    "Link": "http://austintexas.gov/news/traffic-fatality-49-5",
    "Location": "3505 Montopolis Drive",
    "Notes": "The preliminary investigation shows that a 2010, red Chevrolet Tahoe and a 2014, silver Chevrolet Malibu were driving northbound in the 3500 block of Montopolis at a very high rate of speed. The Tahoe hit the back of the Impala and lost control, leaving the roadway. The Tahoe spun and hit bushes on the LCRA property located at 3505 Montopolis Drive. It continued across the parking lot, striking a tree and coming to rest by the loading dock of the building. The back seat passenger, Josephine Guerra, was ejected during the crash and pronounced deceased at the scene at 5:26 a.m. The driver of the Tahoe and two other passengers fled the scene on foot.\n\n\tThe driver of the Malibu is cooperating with this open and ongoing investigation.",
    "Time": "05:25 AM"
  },
  {
    "1": "Cedric Benson | Black male | 12/28/1982 Deceased",
    "2": "Aamna Najam | Asian female | 01/26/1992",
    "Age": 36,
    "Case": "19-2291933",
    "DOB": "12/28/1982",
    "Date": "08/17/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "50",
    "First Name": "Cedric",
    "Gender": "male",
    "Last Name": "Benson",
    "Link": "http://austintexas.gov/news/traffic-fatality-50-3",
    "Location": "4500 FM 2222/Mount Bonnell Road Deceased",
    "Notes": "Deceased 2:  Aamna Najam | Asian female | 01/26/1992\n\tThe preliminary investigation yielded testimony from witnesses who reported seeing the BMW motorcycle driven by Cedric Benson traveling at a high rate of speed westbound in the left lane of FM 2222. A white, 2014 Dodge van was stopped at the T-intersection of Mount Bonnell Road and FM 2222. After checking for oncoming traffic, the van attempted to turn left on to FM 2222 when it was struck by the oncoming motorcycle.\n\n\tThe driver of the van was evaluated by EMS on scene and refused transport. The passenger of the van and a bystander at the scene attempted to render aid to Mr. Benson and his passenger Aamna Najam. Cedric Benson and Aamna Najam were both pronounced on scene.\n\n\tThe van driver remained on scene and is cooperating with the ongoing investigation.\n\n\tThe family of Cedric Benson respectfully requests privacy during this difficult time and asks that media refrain from contacting them.",
    "Time": "10:20 PM"
  },
  {
    "Age": 47,
    "Case": "19-2311712",
    "DOB": "02/14/1972",
    "Date": "08/19/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "51",
    "First Name": "Anthony",
    "Gender": "male",
    "Last Name": "Ukadibia",
    "Link": "http://austintexas.gov/news/traffic-fatality-51-4",
    "Location": "515 E. Slaughter Lane",
    "Notes": "The preliminary investigation indicates that Anthony Ukadibia was leaving the apartment complex located at 515 E. Slaughter Lane in a silver, 2007 Honda Odyssey. As he approached the roadway to make a left, he honked at the vehicle waiting in front of him. When the vehicle didn’t move, Mr. Ukadibia drove around and attempted to cross eastbound Slaughter Lane. He failed to yield right of way and was struck on the driver’s side by an eastbound white, 2000 Mercury 4-door. Anthony Ukadibia, who was not wearing a seatbelt, was ejected from the vehicle and subsequently struck by a 2011 Ford F-150. He was transported to St. David’s South Austin Medical Center by Austin-Travis County EMS where he succumbed to his injuries.\n\n\tThe drivers of the Mercury and the Ford remained on scene. No charges are expected to be filed.",
    "Time": "07:58 PM"
  },
  {
    "Age": 36,
    "Case": "19-2351073",
    "DOB": "11/17/1982",
    "Date": "08/23/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "52",
    "First Name": "Anthony",
    "Gender": "male",
    "Last Name": "Washington",
    "Link": "http://austintexas.gov/news/traffic-fatality-52-5",
    "Location": "S. IH-35 SB/E. Ben White Blvd. service roads",
    "Notes": "The preliminary investigation indicates that Anthony Wayne Washington was riding a bicycle eastbound on the Ben White Blvd. service road when he ran a red light and crossed over into the southbound lanes of the S. IH-35 service road. The driver of a silver, 2017 Chevrolet Cruz was driving in the far left lane of the IH-35 service road when she saw Mr. Washington enter the intersection. She honked to alert him while attempting to stop in time, but he crashed into her vehicle.\n\n\tAnthony Wayne Washington was transported to St. David’s South Austin Medical Center where he was pronounced deceased shortly thereafter.\n\n\tThe driver of the Chevrolet Cruz remained on scene. No charges are expected to be filed.",
    "Time": "12:59 PM"
  },
  {
    "Age": 54,
    "Case": "19-2440191",
    "DOB": "11/19/1964",
    "Date": "09/01/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "53",
    "First Name": "Smelin",
    "Gender": "male",
    "Last Name": "Velasquez",
    "Link": "http://austintexas.gov/news/traffic-fatality-53-6",
    "Location": "10214 N. IH 35 southbound service road",
    "Notes": "The preliminary investigation shows that a 1999, blue Pontiac was traveling southbound on the frontage road near the 10200 block of N. IH 35 when it left the roadway for unknown reasons. The vehicle went through a business parking lot and struck a parked vehicle and a pallet of landscaping stones before coming to rest against a business building. The driver was ejected from the vehicle and died at the scene. The front seat passenger was transported to a nearby hospital for treatment.",
    "Time": "01:48 AM"
  },
  {
    "Age": 25,
    "Arrested": "Dionnet Suarez De La Cruz, Hispanic male, 34 years of age",
    "Case": "19-2440444",
    "DOB": "09/16/1993",
    "Date": "09/01/2019",
    "Ethnicity": "male",
    "Fatal crashes this year": "54",
    "First Name": "Felipe",
    "Gender": "born",
    "Last Name": "Hispanic",
    "Link": "http://austintexas.gov/news/traffic-fatality-54-4",
    "Location": "9200 Metric Blvd.",
    "Notes": "The preliminary investigation shows that a 2005 Suzuki motorcycle was traveling northbound in the 9200 block of Metric Blvd. and a 2018, black Toyota Camry was traveling southbound in the northbound lanes of Metric Blvd. The Camry crashed head-on into the motorcycle. The driver of the motorcycle died at the scene. The driver of the Camry was arrested for DWI and Intoxication Manslaughter.",
    "Time": "05:16 AM"
  },
  {
    "Age": 30,
    "Case": "19-2450248",
    "DOB": "05/10/1989",
    "Date": "09/02/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "55",
    "First Name": "Edgar",
    "Gender": "male",
    "Last Name": "Montoya",
    "Link": "http://austintexas.gov/news/traffic-fatality-55-4",
    "Location": "1500 N. IH 35 Southbound",
    "Notes": "The preliminary investigation shows that a pedestrian was attempting to cross the 1500 block of N. IH 35 from west to east. A semi tractor-trailer and multiple other vehicles struck the pedestrian. The driver of the tractor-trailer remained on scene and the pedestrian was pronounced deceased at the scene.",
    "Time": "03:09 AM"
  },
  {
    "Age": 52,
    "Case": "19-2500231",
    "DOB": "03/17/1967",
    "Date": "09/07/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "56",
    "First Name": "Louis",
    "Gender": "male",
    "Last Name": "Chambers",
    "Link": "http://austintexas.gov/news/traffic-fatality-56-5",
    "Location": "6500 N. IH-35 SB",
    "Notes": "The preliminary investigation shows that Louis Chambers was attempting to cross N. IH-35 SB in the 6500 block when he was struck by a green, 2011 Ford Focus that was traveling in the inside lane. Louis Chambers was pronounced deceased on scene.\n\n\tThe driver of the Ford Focus remained at the crash site and is cooperating with the investigation. No charges are expected to be filed.",
    "Time": "02:20 AM"
  },
  {
    "Age": 41,
    "Case": "19-2540190",
    "DOB": "06/19/1978",
    "Date": "09/11/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "58",
    "First Name": "Joe",
    "Gender": "male",
    "Last Name": "Ogg",
    "Link": "http://austintexas.gov/news/traffic-fatality-58-4",
    "Location": "Hwy 290 WB at the 183 SB Flyover",
    "Notes": "The preliminary investigation shows Joe H. Ogg was driving a red, 2001 Harley Davidson Motorcycle westbound on Hwy 290 to the southbound 183 flyover when he failed to negotiate the curve and struck a wall with the bike. Joe Ogg went over the wall, falling into the westbound lanes of 290 below. He was pronounced deceased on scene.",
    "Time": "04:37 AM"
  },
  {
    "Age": 54,
    "Case": "19-2560573",
    "DOB": "01/06/1965",
    "Date": "09/13/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "59",
    "First Name": "Scott",
    "Gender": "male",
    "Last Name": "Remmenga",
    "Link": "http://austintexas.gov/news/traffic-fatality-59-4",
    "Location": "Hwy 290 WB Service Road at Parmer Lane",
    "Notes": "The preliminary investigation shows that Scott Remmenga was riding a Honda Silverwing Motorcycle westbound on the 290 service road when the driver of a white, 2016 Toyota Tundra that was traveling parallel to the bike attempted to turn left from the wrong lane, striking Scott Remmenga. He was transported to Dell Seton Medical Center at the University of Texas where he died a short time later.\n\n\tThe driver of the Tundra remained on scene and is cooperating with the investigation.",
    "Time": "08:42 AM"
  },
  {
    "Age": 42,
    "Case": "19-2540094",
    "DOB": "07/26/1977",
    "Date": "09/11/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "57",
    "First Name": "Jeanny",
    "Gender": "male",
    "Last Name": "Nunez-Noguera",
    "Link": "http://austintexas.gov/news/traffic-fatality-57-4",
    "Location": "11400 N. IH-35 NB",
    "Notes": "The preliminary investigation shows that Jeanny Nunez-Noguera was in the right lane in the 11400 block of N. IH-35 NB proper when he was struck by a red, 2016 Honda Civic.\n\n\tThe driver of the Honda Civic remained at the crash site and is cooperating with the investigation. No charges are expected to be filed.",
    "Time": "01:40 AM"
  },
  {
    "Age": 26,
    "Arrested": "Debrah Callison | White female | 69 years of age",
    "Case": "19-2661710",
    "DOB": "01/09/1993",
    "Date": "09/23/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "60",
    "First Name": "Christian",
    "Gender": "male",
    "Last Name": "Livingston",
    "Link": "http://austintexas.gov/news/traffic-fatality-60-4",
    "Location": "9000 block of S. Congress Avenue",
    "Notes": "Arrested:      Debrah Callison | White female | 69 years of age\n\tThe preliminary investigation shows that the white, 2018 Toyota RAV-4 driven by Callison was traveling southbound in the outside lane in the 9000 block of S. Congress when she struck Christian Livingson. Mr. Livingston was walking in the roadway rather than on the east curb line sidewalk available to him. He was pronounced deceased at the scene.\n\n\tDebrah Callison remained on scene. She was found to be intoxicated and was arrested for DWI. There are no additional charges anticipated at this time.\n Debrah Callison",
    "Time": "08:23 PM"
  },
  {
    "Age": 23,
    "Case": "19-2700846",
    "DOB": "01/28/1996",
    "Date": "09/27/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "61",
    "First Name": "Jessie",
    "Gender": "male",
    "Last Name": "Woosley",
    "Link": "http://austintexas.gov/news/traffic-fatality-61-4",
    "Location": "E. Parmer Ln. and Dessau Rd.",
    "Notes": "The preliminary investigation shows that a 2003 orange Chevrolet Avalanche Pickup truck was traveling eastbound on E. Parmer Ln. and Dessau Rd. at a high rate of speed. A 2019 white Hyundai Elantra was turning left from E. Parmer Ln. onto Southbound Dessau Rd. with a protected green turn signal. The Avalanche ran the red light and struck the Elantra. The Avalanche then struck a metal pole on the Southeast corner of the intersection. The driver of the Avalanche was pronounced deceased on the scene. The driver and passenger of the Elantra were transported to a local hospital with non-life threatening injuries.",
    "Time": "11:27 AM"
  }
]