[
  {
    "Age": 13,
    "Case": "19-0400694",
    "DOB": "12/05/2005",
    "Date": "02/09/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "7",
    "First Name": "Messiah",
    "Gender": "male",
    "Last Name": "Mouton",
    "Link": "http://austintexas.gov/news/traffic-fatality-7-4",
    "Location": "6000 block of Springdale Road",
    "Notes": "The preliminary investigation shows that the driver of a 1997, red BMW was traveling northbound in the 6000 block of Springdale Road and lost control. The vehicle skidded sideways before flipping and striking a utility pole. The passenger in the vehicle, Messiah Zion Mouton, was pronounced deceased at the scene.",
    "Time": "12:48 p.m."
  },
  {
    "Age": 32,
    "Case": "19-0370320",
    "DOB": "02/18/1986",
    "Date": "02/06/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "6",
    "First Name": "Trevor",
    "Gender": "male",
    "Last Name": "Ralston",
    "Link": "http://austintexas.gov/news/traffic-fatality-6-6",
    "Location": "1000 block of W. Oltorf Street",
    "Notes": "The preliminary investigation shows that the driver of a gray, 2008 Mini Cooper was travelling westbound in the 1000 block of W. Oltorf Street when she lost control and slid into the eastbound path of a gray, 2018 Honda motorcycle. The motorcycle, driven by Trevor Ralston, struck the right side of the Mini Cooper. Trevor Ralston was pronounced deceased on scene. The driver of the Mini Cooper remained at the crash location and was cited for failure to control speed.",
    "Time": "7:02 a.m."
  },
  {
    "Age": 21,
    "Case": "19-0320079",
    "DOB": "10/23/1997",
    "Date": "02/01/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "5",
    "First Name": "Mark",
    "Gender": "male",
    "Last Name": "Sands",
    "Link": "http://austintexas.gov/news/traffic-fatality-5-7",
    "Location": "500 block N. IH 35 service road southbound",
    "Notes": "The preliminary investigation shows that a 2006 silver Volkswagen Jetta operated by an Uber driver was traveling southbound in the right lane of N. IH-35 southbound on the service road. The Jetta changed lanes to enter the ramp of southbound IH 35 when it encountered a Lime scooter. The pedestrian on the scooter was traveling the wrong way, northbound in the southbound left lane of the IH-35 service road. The pedestrian was transported to Dell Seton Medical Center at the University of Texas. He was pronounced deceased at 2:30 p.m. on Saturday, Feb. 2, 2019. The Uber driver remained on scene and is cooperating as this investigation continues. The toxicology results in this case are still pending.",
    "Time": "12:52 a.m."
  },
  {
    "Age": 58,
    "Case": "19-0260086",
    "DOB": "12/31/1960",
    "Date": "01/26/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "4",
    "First Name": "Laura",
    "Gender": "female",
    "Last Name": "Wray",
    "Link": "http://austintexas.gov/news/traffic-fatality-4-6",
    "Location": "6900 block N. IH-35 SB",
    "Time": "1:02 a.m.",
    "Vehicle": "2014 Ford F-150 (black)"
  },
  {
    "Age": 15,
    "Case": "19-0081623",
    "DOB": "02/18/2003",
    "Date": "01/08/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "3",
    "First Name": "Jesus",
    "Gender": "male",
    "Last Name": "Servantez",
    "Link": "http://austintexas.gov/news/traffic-fatality-3-4",
    "Location": "3600 block of South Capital of Texas Highway SB",
    "Notes": "The preliminary investigation shows that the driver of a silver, 2018 KIA was traveling in the center lane of the 3600 block of South Capital of Texas Highway SB when the car collided with Jesus Servantez, a pedestrian in the roadway. The driver remained at the scene and told investigators that he did not see Servantez prior to the crash. Jesus Servantez was transported to Saint David’s South Austin Medical Center where he succumbed to his injuries on January 21, 2019. No charges are expected to be filed. APD is investigating this case. Anyone with information regarding this case should call APD’s Vehicular Homicide Unit Detectives at (512) 974-3761. You can also submit tips by downloading APD’s mobile app, Austin PD, for free on iPhone and Android. This is Austin’s third fatal traffic crash of 2018, resulting in three fatalities this year. At this time in 2018, there were two fatal traffic crashes and three traffic fatalities. These statements are based on the initial assessment of the fatal crash and investigation is still pending. Fatality information may change.",
    "Time": "9:37 p.m."
  },
  {
    "Age": 31,
    "Case": "19-0150158",
    "DOB": "07/09/1987",
    "Date": "01/15/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "1",
    "First Name": "David",
    "Gender": "male",
    "Last Name": "Sell",
    "Link": "http://austintexas.gov/news/traffic-fatality-1-4",
    "Location": "10500 block of N IH 35 SB",
    "Notes": "The preliminary investigation shows that a 2000 Peterbilt semi truck was travelling southbound in the center lane on IH 35 when it struck pedestrian David Sell. The driver stopped as soon as it was possible to do so and remained on scene. He reported not seeing the pedestrian prior to impact given that it was still dark at the time of the crash. Sell was pronounced deceased at the scene at 6:24 a.m. No charges are expected to be filed. APD is investigating this case. Anyone with information regarding this case should call APD’s Vehicular Homicide Unit Detectives at (512) 974-3761. You can also submit tips by downloading APD’s mobile app, Austin PD, for free on iPhone and Android. This is Austin’s first fatal traffic crash of 2018, resulting in one fatality this year. At this time in 2018, there was one fatal traffic crash and two traffic fatalities. These statements are based on the initial assessment of the fatal crash and investigation is still pending. Fatality information may change.",
    "Time": "6:20 a.m."
  },
  {
    "Age": 58,
    "Case": "19-0161105",
    "DOB": "02/15/1960",
    "Date": "01/16/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "2",
    "First Name": "Ann",
    "Gender": "female",
    "Last Name": "Bottenfield-Seago",
    "Link": "http://austintexas.gov/news/traffic-fatality-2-3",
    "Location": "West William Cannon Drive and Ridge Oak Road",
    "Notes": "The preliminary investigation shows that the grey, 2003 Volkwagen Jetta being driven by Ann Bottenfield-Seago failed to yield at a stop sign while attempting to turn westbound on to West William Cannon Drive from Ridge Oak Road. The Jetta collided with a black, 2017 Chevrolet truck that was eastbound in the inside lane of West William Cannon Drive. Bottenfield-Seago was pronounced deceased at the scene. The passenger in the Jetta and the driver of the truck were both transported to a local hospital with non-life threatening injuries. No charges are expected to be filed. APD is investigating this case. Anyone with information regarding this case should call APD’s Vehicular Homicide Unit Detectives at (512) 974-3761. You can also submit tips by downloading APD’s mobile app, Austin PD, for free on iPhone and Android. This is Austin’s second fatal traffic crash of 2018, resulting in two fatalities this year. At this time in 2018, there were two fatal traffic crashes and three traffic fatalities. These statements are based on the initial assessment of the fatal crash and investigation is still pending. Fatality information may change.",
    "Time": "3:42 p.m."
  },
  {
    "Age": 19,
    "Case": "19-0581824",
    "DOB": "01/20/2000",
    "Date": "02/27/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "10",
    "First Name": "Javier",
    "Gender": "male",
    "Last Name": "Esparza",
    "Link": "http://austintexas.gov/news/traffic-fatality-10-4",
    "Location": "East 7th Street and Springdale Road",
    "Notes": "The preliminary investigation shows a white, 2000 Lexus RX300 was traveling eastbound on East 7th Street when the driver ran a red light and struck a grey, 2004 Volkswagen Golf moving northbound on Springdale Road. The force of the impact caused both the Lexus and Volkswagen to also strike a white, 2019 Jeep Cherokee that was stopped at the red light. The driver of the Volkswagen Golf, Javier Emanuel Niño Esparza, was pronounced deceased at the scene. The driver of the Lexus, Duane Harris, 29, was transported to a local hospital for treatment following the crash as were two other occupants from the vehicle. Harris has been charged with intoxication manslaughter.",
    "Time": "10:25 p.m."
  },
  {
    "Age": 64,
    "Case": "19-0521894",
    "DOB": "10/10/1954",
    "Date": "02/21/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "9",
    "First Name": "Rosbel",
    "Gender": "male",
    "Last Name": "Tamez",
    "Link": "http://austintexas.gov/news/traffic-fatality-9-4",
    "Location": "7300 block of E. Riverside Dr.",
    "Notes": "The preliminary investigation shows a silver 2017 Jeep Patriot was traveling eastbound in the 7300 block of E. Riverside Dr. A pedestrian, Rosbel Tamez, was crossing Riverside near Uphill St. when he was struck by the Jeep. Mr. Tamez was transported to St. David’s South Austin Hospital where he died a short time later. ",
    "Time": "11:56 p.m."
  },
  {
    "Age": 37,
    "Case": "19-0521569",
    "DOB": "04/15/1981",
    "Date": "02/21/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "8",
    "First Name": "Blair",
    "Gender": "female",
    "Last Name": "Dismukes",
    "Link": "http://austintexas.gov/news/traffic-fatality-8-4",
    "Location": "8100 block of N. Lamar Blvd.",
    "Notes": "The preliminary investigation shows that two pedestrians were crossing mid-block in the 8100 block of N. Lamar Blvd. when both were struck by an unknown vehicle. One pedestrian had minor injuries and the other was pronounced deceased at the scene. The vehicle that hit them fled and has not been yet identified. ",
    "Time": "8:30 p.m."
  },
  {
    "Age": 5,
    "Case": "19-0800389",
    "DOB": "12/12/2013",
    "Date": "03/21/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "14",
    "First Name": "Illianna",
    "Gender": "female",
    "Last Name": "Martinez",
    "Link": "http://austintexas.gov/news/traffic-fatality-14-5",
    "Location": "Palo Blanco Ln. and Teri Rd.",
    "Notes": "Anyone with information regarding this case should call APD’s Vehicular Homicide Unit Detectives at (512) 974-5594. You can also submit tips by downloading APD’s mobile app, Austin PD, for free on iPhone and Android. ",
    "Time": "7:40 a.m."
  },
  {
    "Age": 53,
    "Case": "19-0761827",
    "DOB": "06/30/1965",
    "Date": "03/17/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "13",
    "First Name": "Earnest",
    "Gender": "male",
    "Last Name": "Turner",
    "Link": "http://austintexas.gov/news/traffic-fatality-13-4",
    "Location": "3100 block of N IH 35",
    "Notes": "The preliminary investigation shows that a 2005, silver Nissan Altima was traveling northbound in the 35 block of N IH 35. A pedestrian was attempting to cross IH 35, eastbound, and was struck by the Nissan. The driver of the Nissan was transported to Dell Seton Medical Center at the University of Texas with minor injuries. The driver showed no signs of impairment and no charges are expected. The pedestrian, Earnest Turner, was pronounced deceased on March 30, 2019 at 4:20 p.m. APD is investigating this case. Anyone with information regarding this case should call APD’s Vehicular Homicide Unit Detectives at (512) 974-6935. You can also submit tips by downloading APD’s mobile app, Austin PD, for free on iPhone and Android. ",
    "Time": "9:32 p.m."
  },
  {
    "Age": 45,
    "Case": "19-0881844",
    "DOB": "11/21/1973",
    "Date": "03/29/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "12",
    "First Name": "Carlos",
    "Gender": "male",
    "Last Name": "Jr.",
    "Link": "http://austintexas.gov/news/traffic-fatality-12-4",
    "Location": "7300 S. Congress Avenue",
    "Notes": "The preliminary investigation shows that a 2001, white Chrysler Sebring was traveling northbound in the 7300 block of S. Congress Avenue. Two pedestrians were crossing mid-block in the unlit portion of S. Congress Avenue. The car struck one of the pedestrians and he was pronounced deceased at the scene. The driver of the Chrysler remained on scene. No charges are expected to be filed against the driver. APD is investigating this case. Anyone with information regarding this case should call APD’s Vehicular Homicide Unit Detectives at (512) 974-5594. You can also submit tips by downloading APD’s mobile app, Austin PD, for free on iPhone and Android. ",
    "Time": "8:18 p.m."
  },
  {
    "Age": 28,
    "Case": "19-0871796",
    "DOB": "10/15/1990",
    "Date": "03/28/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "11",
    "First Name": "Jessica",
    "Gender": "female",
    "Last Name": "Saathoff",
    "Link": "http://austintexas.gov/news/traffic-fatality-11-4",
    "Location": "1100 E. Martin Luther King Jr. Blvd.",
    "Notes": "The preliminary investigation shows that a 2013, white Toyota 4 Runner was traveling westbound on E. MLK Jr. Blvd. in the left lane. Witnesses stated that a bicyclist was traveling eastbound on MLK and crossed over the double yellow lines into the path of the Toyota. The bicyclist, Jessica Rae Saathoff, was transported to Dell Seton Medical Center at the University of Texas where she died a short time later.",
    "Time": "9:05 p.m."
  },
  {
    "Age": 27,
    "Case": "19-0921776",
    "DOB": "06/24/1991",
    "Date": "04/02/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "15",
    "First Name": "Garrett",
    "Gender": "male",
    "Last Name": "Davis",
    "Link": "http://austintexas.gov/news/traffic-fatality-15-4",
    "Location": "517 E. Slaughter Lane",
    "Notes": "This is Austin’s 15th fatal traffic crash of 2019, resulting in 15 fatalities this year. At this time in 2018, there were 15 fatal traffic crashes and 16 traffic fatalities.",
    "Time": "10:01 p.m."
  },
  {
    "Age": 69,
    "Case": "19-0961200",
    "DOB": "08/01/1949",
    "Date": "04/06/2019",
    "Ethnicity": "Asian",
    "Fatal crashes this year": "17",
    "First Name": "Wing",
    "Gender": "male",
    "Last Name": "Chou",
    "Link": "http://austintexas.gov/news/traffic-fatality-17-4",
    "Location": "14000 block of N. SH-45",
    "Notes": "This is Austin’s 17th fatal traffic crash of 2019, resulting in 17 fatalities this year. At this time in 2018, there were 15 fatal traffic crashes and 16 traffic fatalities.",
    "Time": "3:26 p.m."
  },
  {
    "Age": 25,
    "Case": "19-0930132",
    "DOB": "01/15/1994",
    "Date": "04/03/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "16",
    "First Name": "Hannah",
    "Gender": "female",
    "Last Name": "Jaggers",
    "Link": "http://austintexas.gov/news/traffic-fatality-16-4",
    "Location": "E. Wells Branch Parkway/S. Heatherwilde Boulevard",
    "Notes": "This is Austin’s 16th fatal traffic crash of 2019, resulting in 16 fatalities this year. At this time in 2018, there were 15 fatal traffic crashes and 16 traffic fatalities.",
    "Time": "2:39 a.m."
  },
  {
    "Age": 77,
    "Case": "19-1080673",
    "DOB": "08/23/1941",
    "Date": "04/18/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "21",
    "First Name": "Elvira",
    "Gender": "female",
    "Last Name": "Trujillo",
    "Link": "http://austintexas.gov/news/traffic-fatality-21-3",
    "Location": "FM 973 and Pearce Lane",
    "Notes": "This is Austin’s 21st fatal traffic crash of 2019, resulting in 22 fatalities this year. At this time in 2018, there were 19 fatal traffic crashes and 20 traffic fatalities.",
    "Time": "10:15 a.m."
  },
  {
    "Age": 46,
    "Case": "19-1110655",
    "DOB": "08/19/1972",
    "Date": "04/21/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "22",
    "First Name": "Aric",
    "Gender": "male",
    "Last Name": "Maxwell",
    "Link": "http://austintexas.gov/news/traffic-fatality-22-3",
    "Location": "5300 blk N. IH-35 SB",
    "Notes": "This is Austin’s 22nd fatal traffic crash of 2019, resulting in 23 fatalities this year. At this time in 2018, there were 19 fatal traffic crashes and 20 traffic fatalities.",
    "Time": "10:38 a.m."
  },
  {
    "Age": -1,
    "Case": "19-1080319",
    "DOB": "05/19/2019",
    "Date": "04/18/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "20",
    "Gender": "male",
    "Link": "http://austintexas.gov/news/traffic-fatality-20-4",
    "Location": "8000 block of West U.S. 290",
    "Notes": "This is Austin’s 20th fatal traffic crash of 2019, resulting in 21 fatalities this year. At this time in 2018, there were 19 fatal traffic crashes and 20 traffic fatalities.",
    "Time": "06:53 a.m."
  },
  {
    "Age": 70,
    "Case": "19-1070614",
    "DOB": "06/25/1948",
    "Date": "04/17/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "19",
    "First Name": "Michael",
    "Gender": "male",
    "Last Name": "Cannatti",
    "Link": "http://austintexas.gov/news/traffic-fatality-19-5",
    "Location": "Jollyville Rd. and Balcones Woods Drive.",
    "Notes": "This is Austin’s 19th fatal traffic crash of 2019, resulting in 20 fatalities this year. At this time in 2018, there were 19 fatal traffic crashes and 20 traffic fatalities.",
    "Time": "10:22 a.m."
  },
  {
    "Age": 55,
    "Case": "19-1070052",
    "DOB": "05/17/1963",
    "Date": "04/17/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "18",
    "First Name": "James",
    "Gender": "male",
    "Last Name": "Bourgeois",
    "Link": "http://austintexas.gov/news/traffic-fatality-18-4",
    "Location": "5600 block of S. Congress Avenue",
    "Notes": "This is Austin’s 18th fatal traffic crash of 2019, resulting in 19 fatalities this year. At this time in 2018, there were 19 fatal traffic crashes and 20 traffic fatalities.",
    "Time": "12:53 a.m."
  },
  {
    "Age": 48,
    "Case": "19-1220286",
    "DOB": "06/09/1970",
    "Date": "05/02/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "25",
    "First Name": "David",
    "Gender": "male",
    "Last Name": "Medrano",
    "Link": "http://austintexas.gov/news/traffic-fatality-25-4",
    "Location": "8700 block of N. Lamar Blvd.",
    "Notes": "Suspect Vehicle: dark colored, small SUV or truck The preliminary investigation shows that a pedestrian was running from west to east on N. Lamar Blvd. in the 8700 block towards a Capital Metro bus stop. At the time, a Capital Metro bus was present. The pedestrian was struck by a dark colored, small SUV or truck as he was running across Lamar towards the bus stop. The vehicle continued to travel northbound on Lamar and fled the scene. The pedestrian was transported the Dell Seton Medical Center at the University of Texas where he died upon arrival.",
    "Time": "6:10 a.m."
  },
  {
    "Age": 23,
    "Case": "19-1161832",
    "DOB": "11/24/1995",
    "Date": "04/26/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "24",
    "First Name": "Leon",
    "Gender": "male",
    "Last Name": "Salmeron",
    "Link": "http://austintexas.gov/news/traffic-fatality-24-5",
    "Location": "8200 block of the Research Boulevard SB Service Road",
    "Notes": "This is Austin’s 24th fatal traffic crash of 2019, resulting in 25 fatalities this year. At this time in 2018, there were 20 fatal traffic crashes and 21 traffic fatalities.",
    "Time": "8:07 p.m."
  },
  {
    "Age": 86,
    "Case": "19-1040737",
    "DOB": "06/04/1932",
    "Date": "04/14/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "23",
    "First Name": "John",
    "Gender": "male",
    "Last Name": "Guiling",
    "Link": "http://austintexas.gov/news/traffic-fatality-23-3",
    "Location": "11200 N. Mopac southbound",
    "Notes": "This is Austin’s 23rd fatal traffic crash of 2019, resulting in 24 fatalities this year. At this time in 2018, there were 19 fatal traffic crashes and 20 traffic fatalities.",
    "Time": "11:06 a.m."
  },
  {
    "Age": 50,
    "Case": "19-1270134",
    "DOB": "12/27/1968",
    "Date": "05/07/2019",
    "Ethnicity": "White",
    "Fatal crashes this year": "26",
    "First Name": "Michael",
    "Gender": "male",
    "Last Name": "Mayes",
    "Link": "http://austintexas.gov/news/traffic-fatality-26-3",
    "Location": "100 block of N. IH-35 SB",
    "Notes": "The preliminary investigation shows Michael Mayes attempted to cross N. I-35 in the 100 block when he was struck by a southbound vehicle traveling in the inside lane. The driver stopped and rendered medical aid immediately. Michael Mayes was transported to a local hospital by Austin-Travis County EMS where he succumbed to his injuries. No charges are expected to be filed. Anyone with information regarding this case should call APD’s Vehicular Homicide Unit Detectives at (512) 974-8544. You can also submit tips by downloading APD’s mobile app, Austin PD, for free on iPhone and Android. ",
    "Time": "2:52 a.m."
  },
  {
    "Age": 26,
    "Case": "19-1320666",
    "DOB": "12/09/1992",
    "Date": "05/12/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "28",
    "First Name": "Cheyanne",
    "Gender": "female",
    "Last Name": "Serrano",
    "Link": "http://austintexas.gov/news/traffic-fatality-28-3",
    "Location": "1000 S. Mopac Expressway NB",
    "Notes": "The preliminary investigation shows that a 1999, tan Toyota Camry was traveling northbound on Mopac Expressway in the 1000 block. For unknown reasons, the driver lost control of the vehicle and slid into a tree in a grassy area between Mopac and the frontage road. Cheyanne Sage Serrano was pronounced deceased at the scene. Anyone with information regarding this case should call APD’s Vehicular Homicide Unit Detectives at (512) 974-5594. You can also submit tips by downloading APD’s mobile app, Austin PD, for free on iPhone and Android. ",
    "Time": "9:58 a.m."
  },
  {
    "Age": 21,
    "Case": "19-1320369",
    "DOB": "04/08/1998",
    "Date": "05/12/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "27",
    "First Name": "Christian",
    "Gender": "male",
    "Last Name": "Barrios",
    "Link": "http://austintexas.gov/news/traffic-fatality-27-4",
    "Location": "11100 N. IH 35 NB",
    "Notes": "The preliminary investigation shows that a 2018 Hyundai Elantra was traveling southbound in the northbound lanes of IH35. There were 911 calls placed that had APD patrol units in route to the area. Before officers arrived, the calls changed to a head-on crash. A 2008 white Hyundai Elantra hit the Yukon head on. The driver of the Elantra, Chiristian Barrios, died at the scene. The driver and passenger of the Yukon were transported to an area hospital with non-life threatening injuries. Both occupants of the Yukon were wearing seatbelts. Anyone with information regarding this case should call APD’s Vehicular Homicide Unit Detectives at (512) 974-5594. You can also submit tips by downloading APD’s mobile app, Austin PD, for free on iPhone and Android. ",
    "Time": "3:50 a.m."
  },
  {
    "Age": -1,
    "Case": "19-1321936",
    "DOB": "08/15/2019",
    "Date": "05/12/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "29",
    "First Name": "Patrick",
    "Gender": "male",
    "Last Name": "Ervin",
    "Link": "http://austintexas.gov/news/traffic-fatality-29-3",
    "Location": "12100 N. IH-35 NB Service road",
    "Notes": "30, 1966",
    "Time": "11:34 p.m."
  },
  {
    "Age": 15,
    "Case": "19-1381928",
    "DOB": "04/27/2004",
    "Date": "05/18/2019",
    "Ethnicity": "Hispanic",
    "Fatal crashes this year": "31",
    "First Name": "Cesar",
    "Gender": "male",
    "Last Name": "Saunders",
    "Link": "http://austintexas.gov/news/traffic-fatality-31-3",
    "Location": "14000 block of N. IH-35 NB",
    "Time": "10:54 p.m."
  },
  {
    "Age": 64,
    "Case": "19-1380171",
    "DOB": "01/14/1955",
    "Date": "05/18/2019",
    "Ethnicity": "Black",
    "Fatal crashes this year": "30",
    "First Name": "Victor",
    "Gender": "male",
    "Last Name": "Carr",
    "Link": "http://austintexas.gov/news/traffic-fatality-30-1",
    "Location": "1100 block of Airport Blvd.",
    "Notes": "The preliminary investigation shows that a 2011, gray Toyota Corolla was traveling northbound in the right lane in the 1100 block of Airport Blvd. A red, 2013 Kia Soul was traveling southbound on Airport Blvd. and turned left in front of the Corolla. The driver of the Kia was transported to Dell Seton Medical Center at the University of Texas and was pronounced deceased at 2:22 a.m. The driver and passenger of the Corolla were transported to an area hospital with non-life threatening injuries. Anyone with information regarding this case should call APD’s Vehicular Homicide Unit Detectives at (512) 974-6935. You can also submit tips by downloading APD’s mobile app, Austin PD, for free on iPhone and Android. ",
    "Time": "1:58 a.m."
  }
]